Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ1024EFF100.PIC
      <edc:AdjustPoint edc:_addr="0x1F8015BC" edc:offset="04"/>
      <edc:SFRDef edc:_addr="0x1F8015C0" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="21" edc:access="----------------------------nnnn" edc:cname="RPD0R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD0R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD0R" edc:desc="" edc:mask="0xf" edc:name="RPD0R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8015C4" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="22" edc:access="----------------------------nnnn" edc:cname="RPD1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD1R" edc:desc="" edc:mask="0xf" edc:name="RPD1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8015C8" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="23" edc:access="----------------------------nnnn" edc:cname="RPD2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD2R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD2R" edc:desc="" edc:mask="0xf" edc:name="RPD2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8015CC" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="24" edc:access="----------------------------nnnn" edc:cname="RPD3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD3R" edc:desc="" edc:mask="0xf" edc:name="RPD3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8015D0" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="25" edc:access="----------------------------nnnn" edc:cname="RPD4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD4R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD4R" edc:desc="" edc:mask="0xf" edc:name="RPD4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8015D4" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="26" edc:access="----------------------------nnnn" edc:cname="RPD5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD5R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD5R" edc:desc="" edc:mask="0xf" edc:name="RPD5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8015D8" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F8015E4" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="27" edc:access="----------------------------nnnn" edc:cname="RPD9R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD9R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD9R" edc:desc="" edc:mask="0xf" edc:name="RPD9R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8015E8" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="28" edc:access="----------------------------nnnn" edc:cname="RPD10R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD10R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD10R" edc:desc="" edc:mask="0xf" edc:name="RPD10R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8015EC" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="29" edc:access="----------------------------nnnn" edc:cname="RPD11R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD11R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD11R" edc:desc="" edc:mask="0xf" edc:name="RPD11R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
