Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ1024EFF100.PIC
      <edc:SFRDef edc:_addr="0x1F810090" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS5" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000000000000000000000000000" edc:name="IFS5" edc:nzwidth="32" edc:por="-0000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C3BIF" edc:desc="" edc:mask="0x1" edc:name="I2C3BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3SIF" edc:desc="" edc:mask="0x1" edc:name="I2C3SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3MIF" edc:desc="" edc:mask="0x1" edc:name="I2C3MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI4EIF" edc:desc="" edc:mask="0x1" edc:name="SPI4EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI4RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI4RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI4TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RTCCIF" edc:desc="" edc:mask="0x1" edc:name="RTCCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FCEIF" edc:desc="" edc:mask="0x1" edc:name="FCEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PREIF" edc:desc="" edc:mask="0x1" edc:name="PREIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SQI1IF" edc:desc="" edc:mask="0x1" edc:name="SQI1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4EIF" edc:desc="" edc:mask="0x1" edc:name="U4EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4RXIF" edc:desc="" edc:mask="0x1" edc:name="U4RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4TXIF" edc:desc="" edc:mask="0x1" edc:name="U4TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C4BIF" edc:desc="" edc:mask="0x1" edc:name="I2C4BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C4SIF" edc:desc="" edc:mask="0x1" edc:name="I2C4SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C4MIF" edc:desc="" edc:mask="0x1" edc:name="I2C4MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI5EIF" edc:desc="" edc:mask="0x1" edc:name="SPI5EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI5RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI5RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI5TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI5TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5EIF" edc:desc="" edc:mask="0x1" edc:name="U5EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5RXIF" edc:desc="" edc:mask="0x1" edc:name="U5RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5TXIF" edc:desc="" edc:mask="0x1" edc:name="U5TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C5BIF" edc:desc="" edc:mask="0x1" edc:name="I2C5BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C5SIF" edc:desc="" edc:mask="0x1" edc:name="I2C5SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C5MIF" edc:desc="" edc:mask="0x1" edc:name="I2C5MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI6IF" edc:desc="" edc:mask="0x1" edc:name="SPI6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI6RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI6RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI6TX" edc:desc="" edc:mask="0x1" edc:name="SPI6TX" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6EIF" edc:desc="" edc:mask="0x1" edc:name="U6EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6RXIF" edc:desc="" edc:mask="0x1" edc:name="U6RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6TXIF" edc:desc="" edc:mask="0x1" edc:name="U6TXIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8100A0" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="----------n--nnnnnn--nnnnn-n-nnn" edc:cname="IFS6" edc:desc="" edc:impl="0x27e7d7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------0--000000--00000-0-000" edc:name="IFS6" edc:nzwidth="32" edc:por="----------0--000000--00000-0-000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCEOSIF" edc:mask="0x1" edc:name="ADCEOSIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCARDYIF" edc:mask="0x1" edc:name="ADCARDYIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCURDYIF" edc:mask="0x1" edc:name="ADCURDYIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADCGRPIF" edc:mask="0x1" edc:name="ADCGRPIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADC0EIF" edc:mask="0x1" edc:name="ADC0EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC1EIF" edc:mask="0x1" edc:name="ADC1EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC2EIF" edc:mask="0x1" edc:name="ADC2EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC3EIF" edc:mask="0x1" edc:name="ADC3EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC4EIF" edc:mask="0x1" edc:name="ADC4EIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADC7EIF" edc:mask="0x1" edc:name="ADC7EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC0WIF" edc:mask="0x1" edc:name="ADC0WIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC1WIF" edc:mask="0x1" edc:name="ADC1WIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC2WIF" edc:mask="0x1" edc:name="ADC2WIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC3WIF" edc:mask="0x1" edc:name="ADC3WIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC4WIF" edc:mask="0x1" edc:name="ADC4WIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADC7WIF" edc:mask="0x1" edc:name="ADC7WIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8100B0" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F8100C0" edc:_begin="0xc0" edc:_end="0x130" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IEC0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIE" edc:desc="" edc:mask="0x1" edc:name="CTIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS0IE" edc:desc="" edc:mask="0x1" edc:name="CS0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS1IE" edc:desc="" edc:mask="0x1" edc:name="CS1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT0IE" edc:desc="" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T1IE" edc:desc="" edc:mask="0x1" edc:name="T1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1EIE" edc:desc="" edc:mask="0x1" edc:name="IC1EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1IE" edc:desc="" edc:mask="0x1" edc:name="IC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC1IE" edc:desc="" edc:mask="0x1" edc:name="OC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1IE" edc:desc="" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2IE" edc:desc="" edc:mask="0x1" edc:name="T2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2EIE" edc:desc="" edc:mask="0x1" edc:name="IC2EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2IE" edc:desc="" edc:mask="0x1" edc:name="IC2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2IE" edc:desc="" edc:mask="0x1" edc:name="OC2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2IE" edc:desc="" edc:mask="0x1" edc:name="INT2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3IE" edc:desc="" edc:mask="0x1" edc:name="T3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3EIE" edc:desc="" edc:mask="0x1" edc:name="IC3EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3IE" edc:desc="" edc:mask="0x1" edc:name="IC3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3IE" edc:desc="" edc:mask="0x1" edc:name="OC3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3IE" edc:desc="" edc:mask="0x1" edc:name="INT3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4IE" edc:desc="" edc:mask="0x1" edc:name="T4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4EIE" edc:desc="" edc:mask="0x1" edc:name="IC4EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4IE" edc:desc="" edc:mask="0x1" edc:name="IC4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4IE" edc:desc="" edc:mask="0x1" edc:name="OC4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4IE" edc:desc="" edc:mask="0x1" edc:name="INT4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5IE" edc:desc="" edc:mask="0x1" edc:name="T5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5EIE" edc:desc="" edc:mask="0x1" edc:name="IC5EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5IE" edc:desc="" edc:mask="0x1" edc:name="IC5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC5IE" edc:desc="" edc:mask="0x1" edc:name="OC5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T6IE" edc:desc="" edc:mask="0x1" edc:name="T6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6EIE" edc:desc="" edc:mask="0x1" edc:name="IC6EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6IE" edc:desc="" edc:mask="0x1" edc:name="IC6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC6IE" edc:desc="" edc:mask="0x1" edc:name="OC6IE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8100D0" edc:_begin="0xc0" edc:_end="0x130" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000u00000000000000000000000000" edc:name="IEC1" edc:nzwidth="32" edc:por="00000x00000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T7IE" edc:desc="" edc:mask="0x1" edc:name="T7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC7EIE" edc:desc="" edc:mask="0x1" edc:name="IC7EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC7IE" edc:desc="" edc:mask="0x1" edc:name="IC7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC7IE" edc:desc="" edc:mask="0x1" edc:name="OC7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T8IE" edc:desc="" edc:mask="0x1" edc:name="T8IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC8EIE" edc:desc="" edc:mask="0x1" edc:name="IC8EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC8IE" edc:desc="" edc:mask="0x1" edc:name="IC8IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC8IE" edc:desc="" edc:mask="0x1" edc:name="OC8IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T9IE" edc:desc="" edc:mask="0x1" edc:name="T9IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC9EIE" edc:desc="" edc:mask="0x1" edc:name="IC9EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC9IE" edc:desc="" edc:mask="0x1" edc:name="IC9IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC9IE" edc:desc="" edc:mask="0x1" edc:name="OC9IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCIE" edc:desc="" edc:mask="0x1" edc:name="ADCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCFIFOIE" edc:mask="0x1" edc:name="ADCFIFOIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCDC1IE" edc:desc="" edc:mask="0x1" edc:name="ADCDC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC2IE" edc:desc="" edc:mask="0x1" edc:name="ADCDC2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC3IE" edc:desc="" edc:mask="0x1" edc:name="ADCDC3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC4IE" edc:desc="" edc:mask="0x1" edc:name="ADCDC4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC5IE" edc:desc="" edc:mask="0x1" edc:name="ADCDC5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC6IE" edc:desc="" edc:mask="0x1" edc:name="ADCDC6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF1IE" edc:desc="" edc:mask="0x1" edc:name="ADCDF1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF2IE" edc:desc="" edc:mask="0x1" edc:name="ADCDF2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF3IE" edc:desc="" edc:mask="0x1" edc:name="ADCDF3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF4IE" edc:desc="" edc:mask="0x1" edc:name="ADCDF4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF5IE" edc:desc="" edc:mask="0x1" edc:name="ADCDF5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF6IE" edc:desc="" edc:mask="0x1" edc:name="ADCDF6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCFLTIE" edc:mask="0x1" edc:name="ADCFLTIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCD0IE" edc:desc="" edc:mask="0x1" edc:name="ADCD0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD1IE" edc:desc="" edc:mask="0x1" edc:name="ADCD1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD2IE" edc:desc="" edc:mask="0x1" edc:name="ADCD2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD3IE" edc:desc="" edc:mask="0x1" edc:name="ADCD3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD4IE" edc:desc="" edc:mask="0x1" edc:name="ADCD4IE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8100E0" edc:_begin="0xc0" edc:_end="0x130" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="2" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC2" edc:desc="" edc:impl="0x3fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000000000000000000000000000" edc:name="IEC2" edc:nzwidth="32" edc:por="--000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD5IE" edc:desc="" edc:mask="0x1" edc:name="ADCD5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD6IE" edc:desc="" edc:mask="0x1" edc:name="ADCD6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD7IE" edc:desc="" edc:mask="0x1" edc:name="ADCD7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD8IE" edc:desc="" edc:mask="0x1" edc:name="ADCD8IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD9IE" edc:desc="" edc:mask="0x1" edc:name="ADCD9IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD10IE" edc:desc="" edc:mask="0x1" edc:name="ADCD10IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD11IE" edc:desc="" edc:mask="0x1" edc:name="ADCD11IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD12IE" edc:desc="" edc:mask="0x1" edc:name="ADCD12IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD13IE" edc:desc="" edc:mask="0x1" edc:name="ADCD13IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD14IE" edc:desc="" edc:mask="0x1" edc:name="ADCD14IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD15IE" edc:desc="" edc:mask="0x1" edc:name="ADCD15IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD16IE" edc:desc="" edc:mask="0x1" edc:name="ADCD16IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD17IE" edc:desc="" edc:mask="0x1" edc:name="ADCD17IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD18IE" edc:desc="" edc:mask="0x1" edc:name="ADCD18IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD19IE" edc:desc="" edc:mask="0x1" edc:name="ADCD19IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD20IE" edc:desc="" edc:mask="0x1" edc:name="ADCD20IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD21IE" edc:desc="" edc:mask="0x1" edc:name="ADCD21IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD22IE" edc:desc="" edc:mask="0x1" edc:name="ADCD22IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD23IE" edc:desc="" edc:mask="0x1" edc:name="ADCD23IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD24IE" edc:desc="" edc:mask="0x1" edc:name="ADCD24IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD25IE" edc:desc="" edc:mask="0x1" edc:name="ADCD25IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD26IE" edc:desc="" edc:mask="0x1" edc:name="ADCD26IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD27IE" edc:desc="" edc:mask="0x1" edc:name="ADCD27IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD28IE" edc:desc="" edc:mask="0x1" edc:name="ADCD28IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD29IE" edc:desc="" edc:mask="0x1" edc:name="ADCD29IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD30IE" edc:desc="" edc:mask="0x1" edc:name="ADCD30IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD31IE" edc:desc="" edc:mask="0x1" edc:name="ADCD31IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD32IE" edc:desc="" edc:mask="0x1" edc:name="ADCD32IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD33IE" edc:desc="" edc:mask="0x1" edc:name="ADCD33IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD34IE" edc:desc="" edc:mask="0x1" edc:name="ADCD34IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x3fffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
