Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ1024EFF100.PIC
      <edc:SFRDef edc:_addr="0x1F860330" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn---nnnnnn" edc:cname="LATD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffffe3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxx---xxxxxx" edc:name="LATD" edc:nzwidth="0x20" edc:por="----------------xxxxxxx---xxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATD0" edc:desc="" edc:mask="0x1" edc:name="LATD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD1" edc:desc="" edc:mask="0x1" edc:name="LATD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD2" edc:desc="" edc:mask="0x1" edc:name="LATD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD3" edc:desc="" edc:mask="0x1" edc:name="LATD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD4" edc:desc="" edc:mask="0x1" edc:name="LATD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD5" edc:desc="" edc:mask="0x1" edc:name="LATD5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATD9" edc:desc="" edc:mask="0x1" edc:name="LATD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD10" edc:desc="" edc:mask="0x1" edc:name="LATD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD11" edc:desc="" edc:mask="0x1" edc:name="LATD11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATD12" edc:desc="" edc:mask="0x1" edc:name="LATD12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATD13" edc:desc="" edc:mask="0x1" edc:name="LATD13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATD14" edc:desc="" edc:mask="0x1" edc:name="LATD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD15" edc:desc="" edc:mask="0x1" edc:name="LATD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860340" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn---nnnnnn" edc:cname="ODCD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffffe3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000---000000" edc:name="ODCD" edc:nzwidth="0x20" edc:por="----------------0000000---000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCD0" edc:desc="" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD1" edc:desc="" edc:mask="0x1" edc:name="ODCD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD2" edc:desc="" edc:mask="0x1" edc:name="ODCD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD3" edc:desc="" edc:mask="0x1" edc:name="ODCD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD4" edc:desc="" edc:mask="0x1" edc:name="ODCD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD5" edc:desc="" edc:mask="0x1" edc:name="ODCD5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCD9" edc:desc="" edc:mask="0x1" edc:name="ODCD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD10" edc:desc="" edc:mask="0x1" edc:name="ODCD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD11" edc:desc="" edc:mask="0x1" edc:name="ODCD11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCD12" edc:desc="" edc:mask="0x1" edc:name="ODCD12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCD13" edc:desc="" edc:mask="0x1" edc:name="ODCD13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCD14" edc:desc="" edc:mask="0x1" edc:name="ODCD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD15" edc:desc="" edc:mask="0x1" edc:name="ODCD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860350" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn---nnnnnn" edc:cname="CNPUD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffffe3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000---000000" edc:name="CNPUD" edc:nzwidth="0x20" edc:por="----------------0000000---000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUD0" edc:desc="" edc:mask="0x1" edc:name="CNPUD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD1" edc:desc="" edc:mask="0x1" edc:name="CNPUD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD2" edc:desc="" edc:mask="0x1" edc:name="CNPUD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD3" edc:desc="" edc:mask="0x1" edc:name="CNPUD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD4" edc:desc="" edc:mask="0x1" edc:name="CNPUD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD5" edc:desc="" edc:mask="0x1" edc:name="CNPUD5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUD9" edc:desc="" edc:mask="0x1" edc:name="CNPUD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD10" edc:desc="" edc:mask="0x1" edc:name="CNPUD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD11" edc:desc="" edc:mask="0x1" edc:name="CNPUD11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD12" edc:desc="" edc:mask="0x1" edc:name="CNPUD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD13" edc:desc="" edc:mask="0x1" edc:name="CNPUD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD14" edc:desc="" edc:mask="0x1" edc:name="CNPUD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD15" edc:desc="" edc:mask="0x1" edc:name="CNPUD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860360" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn---nnnnnn" edc:cname="CNPDD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffffe3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000---000000" edc:name="CNPDD" edc:nzwidth="0x20" edc:por="----------------0000000---000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDD0" edc:desc="" edc:mask="0x1" edc:name="CNPDD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD1" edc:desc="" edc:mask="0x1" edc:name="CNPDD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD2" edc:desc="" edc:mask="0x1" edc:name="CNPDD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD3" edc:desc="" edc:mask="0x1" edc:name="CNPDD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD4" edc:desc="" edc:mask="0x1" edc:name="CNPDD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD5" edc:desc="" edc:mask="0x1" edc:name="CNPDD5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDD9" edc:desc="" edc:mask="0x1" edc:name="CNPDD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD10" edc:desc="" edc:mask="0x1" edc:name="CNPDD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD11" edc:desc="" edc:mask="0x1" edc:name="CNPDD11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD12" edc:desc="" edc:mask="0x1" edc:name="CNPDD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD13" edc:desc="" edc:mask="0x1" edc:name="CNPDD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD14" edc:desc="" edc:mask="0x1" edc:name="CNPDD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD15" edc:desc="" edc:mask="0x1" edc:name="CNPDD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860370" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------n---n-----------" edc:cname="CNCOND" edc:desc="" edc:grp="PORTD" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCOND" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE D" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860380" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn---nnnnnn" edc:cname="CNEND" edc:desc="" edc:grp="PORTD" edc:impl="0xffc0fe3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000---000000" edc:name="CNEND" edc:nzwidth="0x20" edc:por="----------------0000000---000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIED0" edc:desc="" edc:mask="0x1" edc:name="CNIED0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED1" edc:desc="" edc:mask="0x1" edc:name="CNIED1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED2" edc:desc="" edc:mask="0x1" edc:name="CNIED2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED3" edc:desc="" edc:mask="0x1" edc:name="CNIED3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED4" edc:desc="" edc:mask="0x1" edc:name="CNIED4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED5" edc:desc="" edc:mask="0x1" edc:name="CNIED5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIED9" edc:desc="" edc:mask="0x1" edc:name="CNIED9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED10" edc:desc="" edc:mask="0x1" edc:name="CNIED10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED11" edc:desc="" edc:mask="0x1" edc:name="CNIED11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED12" edc:desc="" edc:mask="0x1" edc:name="CNIED12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED13" edc:desc="" edc:mask="0x1" edc:name="CNIED13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED14" edc:desc="" edc:mask="0x1" edc:name="CNIED14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED15" edc:desc="" edc:mask="0x1" edc:name="CNIED15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860390" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn---nnnnnn" edc:cname="CNSTATD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffffe3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000---000000" edc:name="CNSTATD" edc:nzwidth="0x20" edc:por="----------------0000000---000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATD0" edc:desc="" edc:mask="0x1" edc:name="CNSTATD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD1" edc:desc="" edc:mask="0x1" edc:name="CNSTATD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD2" edc:desc="" edc:mask="0x1" edc:name="CNSTATD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD3" edc:desc="" edc:mask="0x1" edc:name="CNSTATD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD4" edc:desc="" edc:mask="0x1" edc:name="CNSTATD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD5" edc:desc="" edc:mask="0x1" edc:name="CNSTATD5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD9" edc:desc="" edc:mask="0x1" edc:name="CNSTATD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD10" edc:desc="" edc:mask="0x1" edc:name="CNSTATD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD11" edc:desc="" edc:mask="0x1" edc:name="CNSTATD11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD12" edc:desc="" edc:mask="0x1" edc:name="CNSTATD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD13" edc:desc="" edc:mask="0x1" edc:name="CNSTATD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD14" edc:desc="" edc:mask="0x1" edc:name="CNSTATD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD15" edc:desc="" edc:mask="0x1" edc:name="CNSTATD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
